FemDesign.Releases.RigidityDataType1
rigidity_data_type1

FemDesign.Releases.RigidityDataType1.#ctor
Parameterless constructor for serialization

FemDesign.Releases.RigidityDataType1.#ctor(FemDesign.Releases.Motions)
Construct RigidityDataType1 with motions only

FemDesign.Releases.RigidityDataType1.#ctor(FemDesign.Releases.Motions,FemDesign.Releases.MotionsPlasticLimits)
Construct RigidityDataType1 with motions and plastic limits forces only